HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
led_event_t			 led_event;
pwm_enevt_t			 pwm_event;
uint8_t 			 relay_status = 0;
nrf_drv_wdt_channel_id m_channel_id;		//wdt
void update_led_event(led_event_e led_event_type);


uint16_t const ntc_table_10K[20] =	
{
	25,	39,	61,	83,	102, 113, 112, 101,	85,
	67,	51,	38,	28,	21,	15,	11,	8, 6, 5, 19
};


APP_PWM_INSTANCE(PWM1,1);                   // Create the instance "PWM1" using TIMER1.


#if NORDIC_SDK_VERSION >= 11
nrf_nvic_state_t nrf_nvic_state = {0};
static nrf_clock_lf_cfg_t m_clock_cfg = 
{
    .source = NRF_CLOCK_LF_SRC_XTAL,    
    .xtal_accuracy = NRF_CLOCK_LF_XTAL_ACCURACY_75_PPM
};

#define MESH_CLOCK_SOURCE       (m_clock_cfg)    /**< Clock source used by the Softdevice. For calibrating timeslot time. */
#else
#define MESH_CLOCK_SOURCE       (NRF_CLOCK_LFCLKSRC_XTAL_75_PPM)    /**< Clock source used by the Softdevice. For calibrating timeslot time. */
#endif

#ifdef NRF51
#define EXAMPLE_DFU_BANK_ADDR   (0x26000)
#endif
#ifdef NRF52
#define EXAMPLE_DFU_BANK_ADDR   (0x40000)
#endif


void shut_pir_sound_timer(void)
{
	uint32_t err_code;	
	err_code = app_timer_stop(m_pir_mes_timer_id);
	APP_ERROR_CHECK(err_code);	
	err_code = app_timer_stop(m_sound_mes_timer_id);
	APP_ERROR_CHECK(err_code);	
}
	
void open_pir_sound_timer(void)
{
    uint32_t err_code;
	err_code = app_timer_start(m_pir_mes_timer_id, PIR_MES_INTERVAL, NULL);				
    APP_ERROR_CHECK(err_code);	
    err_code = app_timer_start(m_sound_mes_timer_id, SOUND_MES_INTERVAL, NULL);			
    APP_ERROR_CHECK(err_code);	
}

void update_pwm_value(uint32_t value)	
{
	
	while (app_pwm_channel_duty_set(&PWM1, 0, value) == NRF_ERROR_BUSY);
	while (app_pwm_channel_duty_set(&PWM1, 1, value) == NRF_ERROR_BUSY);
	
}

int16_t look_up_table(int16_t adc)
{                                        
    int16_t val, work_var;
    int16_t index = 19;
       
    work_var = ntc_table_10K[index]; 
    if(work_var > adc)
    {
        val = (index - 4) * 100; // >= max range, so use the last point of array
        return ((int16_t)val);                                                         
    }                         
    do                        
    {
        index--;
        work_var += ntc_table_10K[index];    //check which range match current value:L14 + (L13 - L14) + (L12-L13) + ... + [L (x - 1) - Lx] + [Lx - L (x + 1) ] = L (x + 1)
        if(work_var > adc)    //can check relative document in : Z:\Designs\Temperature\Curves\ThermistorCurves_VoltageCalcs.xls
        {
            val = (work_var - adc) * 100;    //get the difference value between current value and nearest default point
            val /= ntc_table_10K[index];
            if(index >= 4)
            {
                val += ((index - 4) * 100);    //get nearest temperature point value
                val &= 0x7fff;
            }
            else
            {
                val += index * 100;
                val = 400 - val;
                val |= 0x8000;
            }                     
            return ((int16_t)val);        
        }                 
    } while(index);                                                                      

//	val = index * 100; 
	val = 400 | 0x8000;
    return ((int16_t)val);  
}

int16_t update_temperature(int16_t adc, _Bool c)
{
	int16_t deg_temp = (int16_t)(look_up_table(adc));
	if(deg_temp & 0x8000) // minus temperature
		deg_temp = -(signed int)(deg_temp & 0x7fff);
	
	temp_centigrade = deg_temp + calibration_temperature;
	temp_fahrenheit = temp_centigrade * 9 / 5 + 320;

//	if((output_auto_manual & 0x01) == 0x01)
//		temp_centigrade = output_manual_value_temp;
	if(c)
		return temp_centigrade;
	else 
		return temp_fahrenheit;
		
}


/**
 * @brief WDT events handler.
 */
void wdt_event_handler(void)
{
    LEDS_OFF(LEDS_MASK);
    
    //NOTE: The max amount of time we can spend in WDT interrupt is two cycles of 32768[Hz] clock - after that, reset occurs
}
/**
 * @brief ADC  handler.
 */
void get_channel_adc(void)
{
		adc_sample[0] = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_2);	
		adc_sample[1] = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_3);	
		adc_sample[2] = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_4);
		adc_sample[3] = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_5);	

#ifdef DEBUG_LOG_RTT									
		SEGGER_RTT_printf(0, "adc:%4d,%4d,%4d,%4d \r\n",(uint16_t)adc_sample[0],(uint16_t)adc_sample[1],(uint16_t)adc_sample[2],(uint16_t)adc_sample[3]);		
#endif		
}	
	
/**
 * @brief ADC initialization.
 */
void adc_config(void)
{
    const nrf_adc_config_t nrf_adc_config = NRF_ADC_CONFIG_DEFAULT;

    // Initialize and configure ADC
    nrf_adc_configure( (nrf_adc_config_t *)&nrf_adc_config);
//    nrf_adc_input_select(NRF_ADC_CONFIG_INPUT_4);
//    nrf_adc_int_enable(ADC_INTENSET_END_Enabled << ADC_INTENSET_END_Pos);
//    NVIC_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_HIGH);
//    NVIC_EnableIRQ(ADC_IRQn);
}

void pwm_ready_callback(uint32_t pwm_id)    // PWM callback function
{
    ready_flag = true;
}

void leds_on_for_while(void)
{
	nrf_delay_ms(1500);
	nrf_gpio_pin_clear(BSP_LED_0);
	nrf_gpio_pin_set(BSP_LED_1);
	nrf_gpio_pin_clear(BSP_LED_2);
	nrf_gpio_pin_clear(BSP_LED_3);
}

#ifdef RELAY_LATCH
void relay_on(void)
{
	nrf_gpio_pin_clear(RELAY_OFF);
	nrf_gpio_pin_set(RELAY_ON);
}
void relay_off(void)
{
	nrf_gpio_pin_clear(RELAY_ON);
	nrf_gpio_pin_set(RELAY_OFF);
}
#else
void relay_on(void)
{
	nrf_gpio_pin_set(13);
}
void relay_off(void)
{
	nrf_gpio_pin_clear(13);
}
#endif

void relay_idle(void)
{
	nrf_gpio_pin_clear(RELAY_ON);
	nrf_gpio_pin_clear(RELAY_OFF);
}

void led_communicate_blink(led_event_e led_event_type)
{
	//UNUSED_PARAMETER(led_event_type);
	update_led_event(led_event_type);
	
	nrf_gpio_pin_clear(BSP_LED_1);
	uint32_t err_code = app_timer_start(m_communicate_timer_id, COMMUNICATE_INTERVAL, NULL);
	APP_ERROR_CHECK(err_code);	
}
void motion_sound_event_set(led_event_e led_event_type)
{
	update_led_event(led_event_type);
	nrf_gpio_pin_clear(BSP_LED_1);	
	
	uint32_t err_code = app_timer_start(m_motion_sound_timer_id, MOTION_SOUND_INTERVAL, NULL);
	APP_ERROR_CHECK(err_code);	
	
	memset(&pwm_event,0,sizeof(pwm_event));
	err_code = app_timer_start(m_pwm_update_timer_id, PWM_UPDATE_INTERVAL, &pwm_event);
	APP_ERROR_CHECK(err_code);			
}




