HengYongChao/Light-Switch/examples/nRF51-ble-bcast-mesh-0.8.7/nRF51/examples/BLE_Gateway/main.c
	}else
	{
		err_code = app_timer_stop(m_pwm_update_timer_id);
		APP_ERROR_CHECK(err_code);	

		
	}	
		
}

/**@brief Function for handling the PIR update timer timeout.
 *
 * @details This function will be called each PIR update timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void pir_event_handler(void * p_context)
{
//	uint32_t err_code;
	
	UNUSED_PARAMETER(p_context);	
	//PIR_Buffer[0] = PIR_Buffer[1];
	
	PIR_Buffer[1] = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_4);	
	
	if(PIR_Buffer[1] < 200) 
	{
		update_led_event(MOTION_EVENT);
		motion_sound_event_set(MOTION_EVENT);
				
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "MOTION_EVENT %2d\r\n",(uint16_t)PIR_Buffer[1]);															
#endif	

		shut_pir_sound_timer();
		
	}
		
}
/**@brief Function for handling the sound event timer timeout.
 *
 * @details This function will be called each sound event timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void sound_event_handler(void * p_context)
{
	uint32_t err_code;
	
	UNUSED_PARAMETER(p_context);	
	
	sound_sample = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_2);	
	
	if(sound_sample > 400) 
	{
		update_led_event(SOUND_EVENT);
		motion_sound_event_set(SOUND_EVENT);
		
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "SOUND_EVENT %2d\r\n",(uint16_t)sound_sample);															
#endif	

		err_code = app_timer_stop(m_pir_mes_timer_id);
		APP_ERROR_CHECK(err_code);	
		err_code = app_timer_stop(m_sound_mes_timer_id);
		APP_ERROR_CHECK(err_code);		
	}
		
}

/**@brief Function for handling the light event timer timeout.
 *
 * @details This function will be called each light event timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void light_event_handler(void * p_context)
{
	uint32_t l1;
	UNUSED_PARAMETER(p_context);	
	
	light_sample = nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_3);	
	l1 = (uint32_t)light_sample;
	l1 *= 527;
	l1 /= 2000;		/* k = 1891 */
				
#ifdef DEBUG_LOG_RTT
	SEGGER_RTT_printf(0, "adc:%2d  ",(uint16_t)light_sample);	
	SEGGER_RTT_printf(0, "LUX:%2d\r\n",(uint16_t)l1);															
#endif		
			
}
/**@brief Function for handling the temperature event timer timeout.
 *
 * @details This function will be called each temperature event timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void temperature_event_handler(void * p_context)
{
	uint32_t err_code;
	
	UNUSED_PARAMETER(p_context);				
	temp_sample = update_temperature((int16_t)nrf_adc_convert_single(NRF_ADC_CONFIG_INPUT_5), true);
	
	err_code = ble_temp_Temperature_level_update(&m_temp, (uint8_t)(temp_sample / 10));
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        )
    {
        APP_ERROR_HANDLER(err_code);
    }	
//#ifdef DEBUG_LOG_RTT
//	SEGGER_RTT_printf(0, "temp:%2d\r\n",(int16_t)temp_sample);															
//#endif		
			
}

/**
* @brief General error handler.
*/
static void error_loop(void)
{
    led_config(0, 1);
    led_config(1, 1);		// led1
    led_config(2, 1);
    led_config(3, 1);
    
    __disable_irq(); /* Prevent the mesh from continuing operation. */
    while (true)
    {
        __WFE(); /* sleep */
    }
}
/**
* @brief Softdevice crash handler, never returns
*
* @param[in] pc Program counter at which the assert failed
* @param[in] line_num Line where the error check failed
* @param[in] p_file_name File where the error check failed
*/
void sd_assert_handler(uint32_t pc, uint16_t line_num, const uint8_t* p_file_name)
{
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "sd_assert,pc:%2d,line:%2d,file:%s.\r\n",(uint16_t)pc,(uint16_t)line_num,p_file_name);
#endif    
	error_loop();
}

/**
* @brief App error handle callback. Called whenever an APP_ERROR_CHECK() fails.
*   Never returns.
*
* @param[in] error_code The error code sent to APP_ERROR_CHECK()
* @param[in] line_num Line where the error check failed
* @param[in] p_file_name File where the error check failed
*/
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
#ifdef DEBUG_LOG_RTT
	SEGGER_RTT_printf(0, "app_error,CODE:%2d,line:%2d,file:%s\r\n",(uint16_t)error_code,
																	(uint16_t)line_num, p_file_name);
#endif    
	error_loop();
}

/** @brief Hardware fault handler. */
void HardFault_Handler(void)
{
#ifdef DEBUG_LOG_RTT
		SEGGER_RTT_printf(0, "HardFault_Handler.\r\n  ");
#endif    
	error_loop();
}

void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
#ifdef DEBUG_LOG_RTT
	SEGGER_RTT_printf(0, "app_error_fault,ID:%2d,PC:%2d,info:%2d.\r\n",id,pc,info);
#endif
    error_loop();
}
/**
* @brief Softdevice event handler
*/
void sd_ble_evt_handler(ble_evt_t* p_ble_evt)
{
    rbc_mesh_ble_evt_handler(p_ble_evt);
    nrf_adv_conn_evt_handler(p_ble_evt);
}

/**
* @brief RBC_MESH framework event handler. Defined in rbc_mesh.h. Handles
*   events coming from the mesh. Sets LEDs according to data
*
* @param[in] evt RBC event propagated from framework
*/
static void rbc_mesh_event_handler(rbc_mesh_event_t* p_evt)
{   
    led_communicate_blink(COMMUNICATE_EVENT);
	switch (p_evt->type)
    {
        case RBC_MESH_EVENT_TYPE_CONFLICTING_VAL:
        case RBC_MESH_EVENT_TYPE_NEW_VAL:
        case RBC_MESH_EVENT_TYPE_UPDATE_VAL:
            if (p_evt->params.rx.value_handle > 1)
                break;

            //led_config(p_evt->params.rx.value_handle, p_evt->params.rx.p_data[0]);
            break;
        case RBC_MESH_EVENT_TYPE_TX:
            break;

        case RBC_MESH_EVENT_TYPE_INITIALIZED:
            /* init BLE gateway softdevice application: */
            nrf_adv_conn_init();
            break;
#ifdef MESH_DFU
        case RBC_MESH_EVENT_TYPE_DFU_BANK_AVAILABLE:
            dfu_bank_flash(p_evt->params.dfu.bank.dfu_type);
            break;

